---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData
source: html/907b3344-9d98-32d0-2624-f8095b7f67eb.htm
---
# RebarUpdateCurvesData Methods

Returns attachment type for stirrups to be used in cover calculation.